app/Traits/CitasTrait.php

    public static function citaPelicula(): string
    {
        $citasPeliculas = Cita::where('tipo', Cita::PELICULA)->get();
---
select * from `citas` where `tipo` = 'Pelicula'

    public static function citaSobreCine(): string
    {
        $citasPeliculas = Cita::where('tipo', Cita::SOBRECINE)->get();
---
select * from `citas` where `tipo` = 'SobreCine'