app/Http/Controllers/IndexController.php

select count(*) as aggregate from `obras`
---
    public function obtenerObrasAleatorias(){
        $numPeliculas = Obra::count();

select `id`, `obra_id`, `ruta`, `alt` from `posters` where `posters`.`obra_id` in (2, 3, 7, 21, 22, 25, 26, 28, 40, 47, 48, 52, 53, 58, 62, 63, 64, 69, 70, 73, 74, 75, 80, 82)
select `id`, `titulo` from `obras` where `id` in (22, 82, 58, 75, 3, 21, 40, 73, 70, 80, 63, 69, 28, 64, 25, 7, 47, 26, 48, 62, 2, 52, 53, 74)
---
    public function index(){
        return Inertia::render('Index', [
            'obras' => Obra::select(['id', 'titulo'])
                ->with('poster:id,obra_id,ruta,alt')
                ->whereIn('id', $this->obtenerObrasAleatorias())
                ->get(),
            'verificacionExitosa' => session('verificacionExitosa'),
            'gifNumero' => $this->obtenerUnNumDeGif(),
            /*Citas*/
            'citaInspiring' => Inspiring::quote(),
            'citaQuotable' => $this->citaQuotable(),
            'citaPelicula' => $this->citaPelicula(),
            'citaCine' => $this->citaSobreCine(),
        ]);